app/controllers/home_controller.rb

SELECT "rooms".* FROM "rooms" LIMIT 3
---
	def index
		@rooms = Room.limit(3)