app/controllers/users_controller.rb

	def create
		@user = User.new(params[:user])
		if @user.save
---
INSERT INTO "users" ("bio", "created_at", "email", "full_name", "location", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def update
		@user = User.find(params[:id])
		if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "14"]]
UPDATE "users" SET "full_name" = 'Thaiane Ferreira Braga', "password" = 'senha1', "updated_at" = '2014-07-13 20:29:39.645978' WHERE "users"."id" = 14